tutorials/coupled/conjugateHeatSimpleFoam/conjugateHeatedSolid/constant/solid/thermalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermal
{
    type            constant;
    rho             rho [1 -3 0 0 0] 10;
    C               C [0 2 -2 -1 0] 100;
    k               k [1 1 -3 -1  0] 10;

    // Values not used
    alpha           alpha [0 0 0 -1 0 0 0] 0.0;
    T0              T0 [0 0 0 1 0 0 0] 0.0;

    gaps
    (
    );

    sources
    (
        solidBlock
        {
            type            constant;
            S               S [1 -2 -3 0 0 0 0] 500;
            zones           ( solidBlock );
        }
    );
}

// ************************************************************************* //
